In [3]:
import pandas as pd

In [3]:
pip install pandas

Collecting pandas
  Downloading pandas-1.5.3-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (12.2 MB)
     |████████████████████████████████| 12.2 MB 21.4 MB/s eta 0:00:01
Collecting pytz>=2020.1
  Downloading pytz-2022.7.1-py2.py3-none-any.whl (499 kB)
     |████████████████████████████████| 499 kB 72.7 MB/s eta 0:00:01
Requirement already satisfied: python-dateutil>=2.8.1 in /config/.local/lib/python3.8/site-packages (from pandas) (2.8.2)
Collecting numpy>=1.20.3; python_version < "3.10"
  Downloading numpy-1.24.1-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (17.3 MB)
     |████████████████████████████████| 17.3 MB 63.9 MB/s eta 0:00:01
Requirement already satisfied: six>=1.5 in /config/.local/lib/python3.8/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: pytz, numpy, pandas
  WARNING: The scripts f2py, f2py3 and f2py3.8 are installed in '/config/.local/bin' which is not on PATH.
  Consider adding this directory to PATH or, if you prefer to suppress this warning, use --no-warn-script-location.
Successfully installed numpy-1.24.1 pandas-1.5.3 pytz-2022.7.1
Note: you may need to restart the kernel to use updated packages.

In [1]:
d1={'key1':[1,2,3,4,5,6],
'key2': [7,8,9,10,11,12],
'key3': [7,21,9,10,11,12],
'key4': [7,8,13,10,55,12],


}

In [4]:
pd.DataFrame(d1)

   key1  key2  key3  key4
0     1     7     7     7
1     2     8    21     8
2     3     9     9    13
3     4    10    10    10
4     5    11    11    55
5     6    12    12    12

In [5]:
pd.DataFrame(d1,index=['a','b','c','d','e','f'])

   key1  key2  key3  key4
a     1     7     7     7
b     2     8    21     8
c     3     9     9    13
d     4    10    10    10
e     5    11    11    55
f     6    12    12    12

In [23]:
d2={'key1':[1,2,'kiran',4,5,6],
'key2': [7,8,9,10,11,12],
'key3': [7,21,9,'a',11,12],
'key4': [7,8,13,10,55,12],


}

In [24]:
pd.DataFrame(d2)

    key1  key2 key3  key4
0      1     7    7     7
1      2     8   21     8
2  kiran     9    9    13
3      4    10    a    10
4      5    11   11    55
5      6    12   12    12

In [25]:
data1=pd.DataFrame(d1)
data2=pd.DataFrame(d2)

In [26]:
pd.merge(data1,data2)

    key1  key2 key3  key4
0      1     7    7     7
1      2     8   21     8
2  kiran     9    9    13
3      4    10    a    10
4      5    11   11    55
5      6    12   12    12

In [27]:
pd.merge(data1,data2,how='inner',on='key1')

    key1  key2_x key3_x  key4_x  key2_y key3_y  key4_y
0      1       7      7       7       7      7       7
1      2       8     21       8       8     21       8
2  kiran       9      9      13       9      9      13
3      4      10      a      10      10      a      10
4      5      11     11      55      11     11      55
5      6      12     12      12      12     12      12

In [28]:
pd.merge(data1,data2,how='left',on='key1')

    key1  key2_x key3_x  key4_x  key2_y key3_y  key4_y
0      1       7      7       7       7      7       7
1      2       8     21       8       8     21       8
2  kiran       9      9      13       9      9      13
3      4      10      a      10      10      a      10
4      5      11     11      55      11     11      55
5      6      12     12      12      12     12      12